In [ ]:
"""Find employees with over 15 records of salary, return the emp_no and number of records"""

In [ ]:
"""SQL table creation and data insertion"""
drop table if exists  `salaries` ; 
CREATE TABLE `salaries` (
`emp_no` int(11) NOT NULL,
`salary` int(11) NOT NULL,
`from_date` date NOT NULL,
`to_date` date NOT NULL,
PRIMARY KEY (`emp_no`,`from_date`));
INSERT INTO salaries VALUES(10001,60117,'1986-06-26','1987-06-26');
INSERT INTO salaries VALUES(10001,62102,'1987-06-26','1988-06-25');
INSERT INTO salaries VALUES(10001,66074,'1988-06-25','1989-06-25');
INSERT INTO salaries VALUES(10001,66596,'1989-06-25','1990-06-25');
INSERT INTO salaries VALUES(10001,66961,'1990-06-25','1991-06-25');
INSERT INTO salaries VALUES(10001,71046,'1991-06-25','1992-06-24');
INSERT INTO salaries VALUES(10001,74333,'1992-06-24','1993-06-24');
INSERT INTO salaries VALUES(10001,75286,'1993-06-24','1994-06-24');
INSERT INTO salaries VALUES(10001,75994,'1994-06-24','1995-06-24');
INSERT INTO salaries VALUES(10001,76884,'1995-06-24','1996-06-23');
INSERT INTO salaries VALUES(10001,80013,'1996-06-23','1997-06-23');
INSERT INTO salaries VALUES(10001,81025,'1997-06-23','1998-06-23');
INSERT INTO salaries VALUES(10001,81097,'1998-06-23','1999-06-23');
INSERT INTO salaries VALUES(10001,84917,'1999-06-23','2000-06-22');
INSERT INTO salaries VALUES(10001,85112,'2000-06-22','2001-06-22');
INSERT INTO salaries VALUES(10001,85097,'2001-06-22','2002-06-22');
INSERT INTO salaries VALUES(10001,88958,'2002-06-22','9999-01-01');
INSERT INTO salaries VALUES(10002,72527,'1996-08-03','1997-08-03');

In [ ]:
"""SQL solution"""
SELECT emp_no, COUNT(*) AS t
FROM salaries
GROUP BY emp_no
HAVING t > 15

In [1]:
"""Pandas dataframe creation"""
import pandas as pd
import numpy as np

salary = np.array([[10001,60117,'1986-06-26','1987-06-26'],
                   [10001,62102,'1987-06-26','1988-06-25'],
                   [10001,66074,'1988-06-25','1989-06-25'],
                   [10001,66596,'1989-06-25','1990-06-25'],
                   [10001,66961,'1990-06-25','1991-06-25'],
                   [10001,71046,'1991-06-25','1992-06-24'],
                   [10001,74333,'1992-06-24','1993-06-24'],
                   [10001,75286,'1993-06-24','1994-06-24'],
                   [10001,75994,'1994-06-24','1995-06-24'],
                   [10001,76884,'1995-06-24','1996-06-23'],
                   [10001,80013,'1996-06-23','1997-06-23'],
                   [10001,81025,'1997-06-23','1998-06-23'],
                   [10001,81097,'1998-06-23','1999-06-23'],
                   [10001,84917,'1999-06-23','2000-06-22'],
                   [10001,85112,'2000-06-22','2001-06-22'],
                   [10001,85097,'2001-06-22','2002-06-22'],
                   [10001,88958,'2002-06-22','9999-01-01'],
                   [10002,72527,'1996-08-03','1997-08-03']
                  ])
salaries = pd.DataFrame(data=salary, columns=['emp_no', 'salary', 'from_date', 'to_date'])
salaries.head()

  emp_no salary   from_date     to_date
0  10001  60117  1986-06-26  1987-06-26
1  10001  62102  1987-06-26  1988-06-25
2  10001  66074  1988-06-25  1989-06-25
3  10001  66596  1989-06-25  1990-06-25
4  10001  66961  1990-06-25  1991-06-25

In [25]:
sc = salaries.groupby('emp_no').count().salary
sc

emp_no
10001    17
10002     1
Name: salary, dtype: int64

In [26]:
sc[sc>15]

emp_no
10001    17
Name: salary, dtype: int64